blogs/mysql-auto_increment-out-of-range.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-13 日 08:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL <code>AUTO_INCREMENT</code> runs out of value</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MySQL <code>AUTO_INCREMENT</code> runs out of value</h1>
<p>
某天我们系统的一张表无法INSERT了，但是某些存在的数据一直在更新。我用tcpdump的确看到INSERT请求不断的发往MySQL，程序日志也没有记录INSERT错误。我当时就懵了，MySQL怕不是糊涂了吧！
</p>

<div id="outline-container-org720f419" class="outline-2">
<h2 id="org720f419"><span class="section-number-2">1</span> SQL的失败情况</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>(webhook_alert_id, instance)</code> 组成UNIQUE KEY。
</p>

<ol class="org-ol">
<li><code>INSERT...ON DUPLICATE KEY UPDATE</code> 成功了，但是SELECT刚才写入的值，不存在</li>
<li><code>INSERT</code> 失败，程序没用这个语句，所以没发现错误</li>
</ol>

<pre class="example">
mysql&gt; INSERT INTO alertItemList(webhook_alert_id, instance, status) VALUES (10098161, "10.135.48.67:789", "resolved") ON DUPLICATE KEY UPDATE status = values(status);
Query OK, 2 rows affected (0.00 sec)

mysql&gt; SELECT * FROM alertItemList WHERE webhook_alert_id = 10098161;
Empty set (0.00 sec)

mysql&gt; INSERT INTO alertItemList(webhook_alert_id, instance, status) VALUES (10098161, "10.135.48.67:789", "resolved");
ERROR 1062 (23000): Duplicate entry '4294967295' for key 'PRIMARY'
</pre>
</div>
</div>

<div id="outline-container-org6c0e33f" class="outline-2">
<h2 id="org6c0e33f"><span class="section-number-2">2</span> 失败原因</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>4294967295</code> 看到这个数字，失败原因就知道七七八八了， 肯定是整数溢出了。查看表结构， <code>`id` int(10) unsigned NOT NULL AUTO_INCREMENT</code> 果然如此。
</p>
</div>

<div id="outline-container-org291ede3" class="outline-3">
<h3 id="org291ede3"><span class="section-number-3">2.1</span> 为什么INSERT报错是 <code>Duplicate entry</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
翻看<a href="https://dev.mysql.com/doc/refman/8.0/en/innodb-auto-increment-handling.html"> MySQL文档</a> 有这么一句：
</p>

<blockquote>
<p>
When an <code>AUTO_INCREMENT</code> integer column runs out of values, a subsequent INSERT operation returns a duplicate-key error. This is general MySQL behavior.
</p>
</blockquote>

<p>
把错误类型归结为1062，让 <code>INSERT...ON DUPLICATE KEY UPDATE</code> 变得危险起来
</p>
</div>
</div>

<div id="outline-container-orgd5381ea" class="outline-3">
<h3 id="orgd5381ea"><span class="section-number-3">2.2</span> <code>AUTO_INCREMENT</code> 变的危险起来</h3>
<div class="outline-text-3" id="text-2-2">
<p>
如上， <code>INSERT...ON DUPLICATE KEY UPDATE</code> 成功了，因为 <code>PRIMARY KEY</code> duplicate了，所以不是INSERT了，而是总是在UPDATE最后一行，这解释了为啥SELECT不出来。 使用 <code>INSERT...ON DUPLICATE KEY UPDATE</code> 的本意是unique key duplicate时更新，绝对不是 <code>AUTO_INCREMENT</code> out of values导致duplicate时更新。
</p>

<p>
就这样，真正的INSERT丢失了，而最后一行的数据一直被意外的更新。
</p>
</div>
</div>
</div>

<div id="outline-container-orgfe28aec" class="outline-2">
<h2 id="orgfe28aec"><span class="section-number-2">3</span> 如何避免</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>如果不确定， <code>AUTO_INCREMENT</code> 使用 BIGINT</li>
<li>监控 <code>AUTO_INCREMENT</code> 的位置，  <code>SELECT id FROM t ORDER BY id DESC LIMIT 1</code></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2020-09-13 日 08:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
